matemat/polynomes-et-exponentielles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2026-01-10 sam 15:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Eclats de vers : Matemat : Polynômes et exponentielles</title>
<meta name="author" content="chimay" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style/defaut.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Eclats de vers : Matemat : Polynômes et exponentielles</h1>
<p>
<a href="index.html">Index mathématique</a>
</p>

<p>
<a href="../index.html">Retour à l’accueil</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table des matières</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org43b22d6">1. Chebyshev</a></li>
<li><a href="#org0846b98">2. Hermite</a></li>
<li><a href="#orgd99f0d8">3. Laguerre</a></li>
</ul>
</div>
</div>

<script>
MathJax = {
  tex: {
    inlineMath: [['$', '$'], ['\\(', '\\)']],
    packages: {'[+]': ['base','ams','braket']},
    macros: {
      parentheses: ["\\left(#1\\right)", 1],
      crochets: ["\\left[#1\\right]", 1],
      accolades: ["\\left\\{#1\\right\\}", 1],
      ensemble: ["\\left\\{#1\\right\\}", 1],
      cardinal: ["\\mathop{\\mathrm{card}\\ }\\limits",0],
      identite: "\\mathrm{Id}",
      indicatrice: "\\boldsymbol{\\delta}",
      dirac: "\\delta",
      moinsun: "-1",
      inverse: "\\ddagger",
      pinverse: "\\dagger",
      topologie: "\\mathfrak{T}",
      ferme: "\\mathfrak{F}",
      img: "\\mathbf{i}",
      binome: ["\\left\\{ \\begin{array}{c} #1 \\\\ #2 \\\\ \\end{array} \\right\\}", 2],
      arcdecercle: ["\\overparen{#1}", 1],
      anglecirc: ["\\widehat{#1}", 1],
      degre: ["#1^\\circ", 1],
      vecteur: ["\\overrightarrow{#1}", 1],
      canonique: "\\mathfrak{c}",
      tenseuridentite: "\\boldsymbol{\\mathcal{I}}",
      permutation: "\\boldsymbol{\\epsilon}",
      matriceZero: "\\mathfrak{0}",
      matriceUn: "\\mathfrak{1}",
      christoffel: ["\\begin{Bmatrix} #1 \\\\ #2 \\\\ \\end{Bmatrix}", 2],
      lagrangien: "\\mathfrak{L}",
      sousens: "\\mathfrak{P}",
      partition: "\\mathrm{Partition}",
      tribu: "\\mathrm{Tribu}",
      topologies: "\\mathrm{Topo}",
      setB: "\\mathbb{B}",
      setN: "\\mathbb{N}",
      setZ: "\\mathbb{Z}",
      setQ: "\\mathbb{Q}",
      setR: "\\mathbb{R}",
      setC: "\\mathbb{C}",
      corps: "\\mathbb{K}",
      boule: "\\mathfrak{B}",
      intervalleouvert: ["\\left] #1 , #2 \\right[", 2],
      intervallesemiouvertgauche: ["\\left] #1 , #2 \\right]", 2],
      intervallesemiouvertdroite: ["\\left[ #1 , #2 \\right[", 2],
      fonction: "\\mathbb{F}",
      bijection: "\\mathrm{Bij}",
      polynome: "\\mathrm{Poly}",
      lineaire: "\\mathrm{Lin}",
      continue: "\\mathrm{Cont}",
      homeomorphisme: "\\mathrm{Hom}",
      etagee: "\\mathrm{Etagee}",
      lebesgue: "\\mathrm{Leb}",
      lipschitz: "\\mathrm{Lip}",
      suitek: "\\mathrm{Suite}",
      matrice: "\\mathbb{M}",
      krylov: "\\mathrm{Krylov}",
      tenseur: "\\mathbb{T}",
      essentiel: "\\mathfrak{E}",
      relation: "\\mathrm{Rel}",
      strictinferieur: "<",
      strictsuperieur: ">",
      ensinferieur: "\\eqslantless",
      enssuperieur: "\\eqslantgtr",
      esssuperieur: "\\gtrsim",
      essinferieur: "\\lesssim",
      essegal: "\\eqsim",
      union: "\\cup",
      intersection: "\\cap",
      opera: "\\divideontimes",
      autreaddition: "\\boxplus",
      autremultiplication: "\\circledast",
      commutateur: ["\\left[ #1 , #2 \\right]", 2],
      convolution: "\\circledcirc",
      correlation: "\\natural",
      diventiere: "\\div",
      modulo: "\\bmod",
      pgcd: ["\\mathop{\\mathrm{pgcd}\\ }\\limits",0],
      ppcm: ["\\mathop{\\mathrm{ppcm}\\ }\\limits",0],
      produitscalaire: ["\\left\\langle #1 \\vert #2 \\right\\rangle", 2],
      scalaire: ["\\left\\langle #1 \\| #2 \\right\\rangle", 2],
      braket: ["\\left\\langle #1 \\vert #2 \\vert #3 \\right\\rangle", 3],
      orthogonal: "\\bot",
      forme: ["\\left\\langle #1 , #2 \\right\\rangle", 2],
      biforme: ["\\left\\langle #1 , #2 , #3 \\right\\rangle", 3],
      contraction: ["\\left\\langle #1 \\odot #3 \\right\\rangle_{#2}", 3],
      dblecont: ["\\left\\langle #1 \\vert #3 \\vert #5 \\right\\rangle_{#2,#4}", 5],
      major: ["\\mathop{\\mathrm{major}\\ }\\limits",0],
      minor: ["\\mathop{\\mathrm{minor}\\ }\\limits",0],
      maxim: ["\\mathop{\\mathrm{maxim}\\ }\\limits",0],
      minim: ["\\mathop{\\mathrm{minim}\\ }\\limits",0],
      argument: ["\\mathop{\\mathrm{arg}\\ }\\limits",0],
      argmin: ["\\mathop{\\mathrm{arg\\,min}\\ }\\limits",0],
      argmax: ["\\mathop{\\mathrm{arg\\,max}\\ }\\limits",0],
      supessentiel: ["\\mathop{\\mathrm{ess\\,sup}\\ }\\limits",0],
      infessentiel: ["\\mathop{\\mathrm{ess\\,inf}\\ }\\limits",0],
      dual: "\\star",
      vardual: "\\circledast",
      distance: "\\mathfrak{dist}",
      aire: "\\mathfrak{aire}",
      norme: ["\\left\\lVert #1 \\right\\rVert", 1],
      normetrois: ["\\left|\\left\\| #1 \\right\\|\\right|", 1],
      adh: ["\\mathop{\\mathrm{adh}\\ }\\limits",0],
      interieur: ["\\mathop{\\mathrm{int}\\ }\\limits",0],
      frontiere: "\\partial",
      image: ["\\mathop{\\mathrm{im}\\ }\\limits",0],
      domaine: ["\\mathop{\\mathrm{dom}\\ }\\limits",0],
      noyau: ["\\mathop{\\mathrm{ker}\\ }\\limits",0],
      support: ["\\mathop{\\mathrm{supp}\\ }\\limits",0],
      signe: ["\\mathop{\\mathrm{sign}\\ }\\limits",0],
      abs: ["\\left\\lvert #1 \\right\\rvert", 1],
      unsur: ["\\frac{1}{#1}", 1],
      arrondisup: ["\\lceil #1 \\rceil", 1],
      arrondiinf: ["\\lfloor #1 \\rfloor", 1],
      conjugue: "\\mathrm{conj\\ }",
      conjaccent: ["\\overline{#1}", 1],
      division: "division",
      difference: "\\boldsymbol{\\Delta}",
      differentielle: ["\\mathfrak{D}^{#1}_{#2}", 2],
      OD: ["\\frac{d #1}{d #2}", 2],
      OOD: ["\\frac{d^2 #1}{d #2^2}", 2],
      NOD: ["\\frac{d^{#3} #1}{d #2^{#3}}", 3],
      deriveepartielle: ["\\frac{\\partial #1}{\\partial #2}", 2],
      PD: ["\\frac{\\partial #1}{\\partial #2}", 2],
      dblederiveepartielle: ["\\frac{\\partial^2 #1}{\\partial #2 \\partial #2}", 2],
      dfdxdy: ["\\frac{\\partial^2 #1}{\\partial #2 \\partial #3}", 3],
      dfdxdx: ["\\frac{\\partial^2 #1}{\\partial #2^2}", 2],
      gradient: "\\mathbf{\\nabla}",
      combilin: ["\\mathrm{span}\\{ #1 \\}", 1],
      trace: "tr",
      proba: "\\mathbb{P}",
      probaof: ["\\mathbb{P}\\left[#1\\right]", 1],
      esperof: ["\\mathbb{E}\\left[#1\\right]", 1],
      cov: ["\\mathrm{cov} ( #1 , #2 )", 2],
      var: ["\\mathrm{var} ( #1 )", 1],
      rand: "\\mathrm{rand}",
      variation: ["\\left\\langle #1 \\right\\rangle", 1],
      composante: ["\\mathop{\\mathrm{comp}\\ }\\limits",0],
      bloc: ["\\mathop{\\mathrm{bloc}\\ }\\limits",0],
      ligne: ["\\mathop{\\mathrm{ligne}\\ }\\limits",0],
      colonne: ["\\mathop{\\mathrm{colonne}\\ }\\limits",0],
      diagonale: ["\\mathop{\\mathrm{diag}\\ }\\limits",0],
      matelementaire: "\\mathrm{Elem}",
      matpermutation: ["\\mathop{\\mathrm{permut}\\ }\\limits",0],
      matunitaire: "\\mathrm{Unitaire}",
      gaussjordan: "\\mathrm{GaussJordan}",
      householder: "\\mathrm{Householder}",
      rang: "rang",
      schur: "\\mathrm{Schur}",
      singuliere: "\\mathrm{DVS}",
      convexe: "\\mathrm{Convexe}",
      petito: ["o(#1)", 1],
      grando: ["O(#1)", 1]
    }
  }
};
</script>

<!-- simple online version -->
<!-- <script async src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js"></script> -->

<!-- script embedded in tree -->
<!-- <script src="../include/mathjax/tex-mml-chtml.js"></script> -->

<!-- hybrid online/offline -->
<!-- does not work -->

<p>
\label{chap:polyexpo}
</p>
<div id="outline-container-org43b22d6" class="outline-2">
<h2 id="org43b22d6"><span class="section-number-2">1.</span> Chebyshev</h2>
<div class="outline-text-2" id="text-1">
<p>
Les polynômes de Chebyshev \(T_n\) sont défini par :
</p>

<div class="org-center">
<p>
\(
T_n : x\mapsto\cos(n \arccos(x) ) \)
</p>

<p>
\(
T_n(\cos(\theta)) = \cos(n \theta)
\)
</p>
</div>

<p>
Il est clair que :
</p>

<div class="org-center">
<p>
\(
T_0(x) = 1 \)
</p>

<p>
\(
T_1(x) = x
\)
</p>
</div>

<p>
Les propriétés des fonctions trigonométriques :
</p>

<div class="org-center">
<p>
\(
\cos[(n+m)\theta]= \cos[n\theta]\cos[m\theta]+\sin[n\theta]\sin[m\theta] \)
</p>

<p>
\(
\cos[(n-m)\theta]= \cos[n\theta]\cos[m\theta]-\sin[n\theta]\sin[m\theta]
\)
</p>
</div>

<p>
nous montrent que :
</p>

<p>
\[T_{n+m}(x) + T_{n-m}(x) = 2 T_n(x) T_m(x)\]
</p>

<p>
On en déduit entre autre que :
</p>

<p>
\[T_{n+1}(x) + T_{n-1}(x) = 2 x T_n(x)\]
</p>

<p>
Les fonctions \(T_n\) sont donc des polynômes. Comme :
</p>

<p>
\[T_n \left[ \cos\left(\frac{2k+1}{2n}\right) \right] = 0\]
</p>

<p>
les racines sont données par :
</p>

<p>
\[x_k = \cos\left(\frac{2k+1}{2n}\right)\]
</p>

<p>
pour \(k=0,1,...,n-1\).
On déduit aussi la propriété suivante de la définition :
</p>

<p>
\[(T_n \circ T_m)(x) = T_{m \cdot n}(x) = (T_m \circ T_n)(x)\]
</p>

<p>
Nous allons voir que les \(T_n\) sont orthogonaux moyennant un certain
poids. Si \(m = n = 0\), il est clair que :
</p>

<p>
\[\int_0^\pi T_0(\cos(\theta)) T_0(\cos(\theta)) d\theta = \int_0^\pi d\theta = \pi\]
</p>

<p>
Si \(m, n \ne 0\), on a :
</p>

<div class="org-center">
<p>
\(
\int_0^\pi T_m(\cos(\theta)) T_n(\cos(\theta)) d\theta =
\int_0^\pi \cos(m\theta) \cos(n\theta) d\theta \)
</p>

<p>
\(
\int_0^\pi T_m(\cos(\theta)) T_n(\cos(\theta)) d\theta =
\unsur{2} \int_0^\pi \cos[(m+n)\theta] d\theta +
\unsur{2} \int_0^\pi \cos[(m-n)\theta] d\theta
\)
</p>
</div>

<p>
Si \(m = n\), on a alors :
</p>

<p>
\[\int_0^\pi T_m(\cos(\theta)) T_n(\cos(\theta)) d\theta = \unsur{2n} [\sin(2 n \pi) - \sin(0)] + \frac{\pi}{2}\]
</p>

<p>
La première intégrale s'annule donc par périodicité de la fonction
\(\sin\). A présent, si \(m \ne n\), on a :
</p>

<div class="org-center">
<p>
\(
\int_0^\pi T_m(\cos(\theta)) T_n(\cos(\theta)) d\theta = \)
</p>

<p>
\(
\unsur{2(m+n)} [\sin[(m+n)\pi] - \sin(0)] + \)
</p>

<p>
\(
\unsur{2(m-n)} [\sin[(m-n)\pi] - \sin(0)] = 0
\)
</p>
</div>

<p>
Rassemblant ces résultats, on obtient :
</p>

<div class="org-center">
<p>
\(
&int;<sub>0</sub>^&pi; T<sub>m</sub>(cos&theta;) T<sub>n</sub>(cos&theta;) d&theta; =
</p>
\begin{cases}
\pi & \mbox{si  } m = 0 \\
\pi/2 & \mbox{si  } m = n \ne 0 \\
0 & \mbox{si  } m \ne n
\end{cases}
<p>
\)
</p>
</div>

<p>
Le changement de variable \(x = \cos(\theta)\),
</p>

<div class="org-center">
<p>
\(
dx = -\sin(\theta) d\theta \)
</p>

<p>
\(
d\theta = \frac{dx}{\sqrt{1-x^2}}
\)
</p>
</div>

<p>
nous donne :
</p>

<p>
\[\int_0^\pi T_m(\cos\theta) T_n(\cos\theta) d\theta = \int_{-1}^1 \frac{T_m(x) T_n(x)}{\sqrt{1-x^2}}dx\]
</p>

<p>
On en déduit que :
</p>

<p>
\[\int_{-1}^1 \frac{T_m(x) T_n(x)}{\sqrt{1-x^2}} dx = \delta_{mn} \frac{\pi}{2} (1+\delta_{m,0})\]
</p>

<p>
pour tout \(m,n\in\setN\).
</p>
</div>
</div>
<div id="outline-container-org0846b98" class="outline-2">
<h2 id="org0846b98"><span class="section-number-2">2.</span> Hermite</h2>
<div class="outline-text-2" id="text-2">
<p>
Les polynômes de Hermite sont orthogonaux pour le produit scalaire :
</p>

<p>
\[\int_{-\infty}^{+\infty} H_n(x) H_m(x) \exp(-x^2) dx = 2^n n ! \sqrt{\pi} \delta_{mn}\]
</p>

<p>
Ils obéissent à la récurrence :
</p>

<div class="org-center">
<p>
\(
H_0(x) = 1 \)
</p>

<p>
\(
H_1(x) = 2 x \)
</p>

<p>
\(
H_{n+1}(x) = 2 x H_n(x) - 2 n H_{n-1}(x) \)
</p>

<p>
\(
\)
</p>
</div>
</div>
</div>
<div id="outline-container-orgd99f0d8" class="outline-2">
<h2 id="orgd99f0d8"><span class="section-number-2">3.</span> Laguerre</h2>
<div class="outline-text-2" id="text-3">
<p>
Les polynômes de Laguerre sont orthogonaux pour le produit scalaire :
</p>

<p>
\[\int_{0}^{+\infty} L_n(x) L_m(x) \exp(-x) dx = \delta_{mn}\]
</p>

<p>
Ils obéissent à la récurrence :
</p>

<div class="org-center">
<p>
\(
L_0(x) = 1 \)
</p>

<p>
\(
L_1(x) = 1-x \)
</p>

<p>
\(
(n+1) L_{n+1}(x) = (2 n + 1 - x) L_n(x) - n L_{n-1}(x)
\)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: chimay</p>
<p class="date">Created: 2026-01-10 sam 15:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
